# Taps
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/bundle'
tap 'nicoverbruggen/homebrew-cask'

# Binaries
brew 'bash' # Latest Bash version
brew 'coreutils' # Those that come with macOS are outdated
brew 'gh'
brew 'git'
brew 'mackup'
brew 'mas' # Mac App Store manager

# Development
brew 'node'
brew 'yarn'
brew 'zsh'

# Apps
cask '1password'
cask 'caffeine'
cask 'btop'
cask 'discord'
cask 'docker'
cask 'fclones'
cask 'figma'
cask 'github'
cask 'hiddenbar'
cask 'iterm2'
cask 'micro'
cask 'orion'
cask 'raycast'
cask 'rustup-init'
cask 'the-unarchiver'
cask 'skiff'
cask 'telegram'
cask 'tradingview'
cask 'zed'

# Fonts
cask 'font-sf-mono'

# Mac App Store
mas 'Vinegar - Tube Cleaner', id: 1591303229
mas 'Wipr', id: 1320666476
